"""Число є парним, якщо його останній біт у двійковому представленні дорівнює 0
(тобто, число ділиться на 2), і непарним, якщо останній біт дорівнює 1 (не ділиться на 2).
Тому ми можемо перевірити останній біт числа за допомогою операції побітового AND (&).
Якщо число має парний останній біт, то результат операції буде 0, а якщо непарний — 1."""


def is_even(number):
    # Перевіряємо останній біт числа
    return (number & 1) == 0 # Якщо останній біт 0, то число парне

# Тести
assert is_even(2494563894038**2) == True, 'Test1'  # 2494563894038^2 - парне
assert is_even(1056897**2) == False, 'Test2'      # 1056897^2 - непарне
assert is_even(24945638940387**3) == False, 'Test3'  # 24945638940387^3 - непарне

print("Всі тести пройдені успішно!")

# Користувацький ввід
user_input = input("Введіть число для перевірки на парність: ")

# Перетворюємо ввід на ціле число
try:
    number = int(user_input)
    # Перевіряємо парність числа та виводимо результат
    if is_even(number):
        print(f"{number} є парним.")
    else:
        print(f"{number} є непарним.")
except ValueError:
    print("Будь ласка, введіть коректне ціле число.")