from inspect import isgenerator

def some_gen(begin, end, func):
    """
    :param begin: перший елемент послідовності
    :param end: кількість елементів у послідовності
    :param func: функція, яка формує значення для послідовності
    """
    # Ініціалізуємо поточне значення, яке буде генеруватися
    current_value = begin

    # Цикл буде виконуватися end разів, генеруючи значення за допомогою yield
    for x in range(end):
        yield current_value  # Повернення поточного значення послідовності

        # Оновлюємо значення за допомогою функції func
        current_value = func(current_value)

# Функція, яка буде використовуватися для перетворення значень послвдовності
def pow(x):
    return x ** 2

# Генератор з початковим значенням 2, кількістю елементів 4, та функцією для піднесення до квадрату
gen = some_gen(2, 4, pow)

# Тести:
assert isgenerator(gen) == True, 'Test1'  # Перевірка, чи є це генератором
assert list(gen) == [2, 4, 16, 256], 'Test2'  # Перевірка правильності значень

print('OK')
