"""Програма перевіряє, чи введений користувачем рядок може бути
    ім'ям змінної, згідно заданих умов """
while True:
    # Імпортуємо необхідні модулі
    import keyword
    import string

    variable = input("Введіть ім'я змінної, або 'exit' для завершення програми: ")

    # Перша умова: змінна не може починатися з цифри
    if variable[0].isdigit():
        print("==>", False)

    # Друга умова: змінна не може містити великі літери
    elif any(x.isupper() for x in variable):
        print("==>", False)

    # Третя умова: зміна не може містити пробіл і знаки пунктуації,
    # окрім нижнього підкреслення "_". Щоб "_" не враховувався, заміняєто його на порожній рядок
    elif any(x in string.punctuation.replace("_", "") for x in variable) or " " in variable:
        print("==>", False)

    # Четверта умова: змінна не може бути жодним із зареестрованих слів
    elif variable in keyword.kwlist:
        print("==>", False)

    # П'ята умова: повне ім'я змінної повинно складатися не більш
    # чим з одного нижнього підкреслення "_"
    elif variable.count("_") > 1 and variable.count("_") == len(variable):
        print("==>", False)

    # Якщо користувач хоче завершити роботу, потрібно ввести "х"
    elif variable == "exit":
        print("Завершення програми!")
        break

    # Якщо всі умови будуть виконані, то ім'я змінної допустиме
    else:
        print("==>", True)